Revit 2027 API
WireConduitTypeSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual WireConduitTypeSetIterator ReverseIterator()
Public Overridable Function ReverseIterator As WireConduitTypeSetIterator
public:
virtual WireConduitTypeSetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> WireConduitTypeSetIterator
override ReverseIterator : unit -> WireConduitTypeSetIterator
Return Value
WireConduitTypeSetIterator
Returns a backward moving iterator to the set.
See Also
Reference
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace